"""
列表元素添加和删除
"""
list1 =[1,5,6,52,228,112]
list1.append(1128)
list1.insert(1,400)
print(list1)
# [1, 400, 5, 6, 52, 228, 112, 1128]
# 合并两个列表
list1.extend([1000,1002])
print(list1)
# [1, 400, 5, 6, 52, 228, 112, 1128, 1000, 1002]
list1 += [200,4851]
print(list1)
# [1, 400, 5, 6, 52, 228, 112, 1128, 1000, 1002, 200, 4851]
print(len(list1))
# 12
# 先通过成员运算判断元素是否在列表中，如果存在就删除元素
if 52 in list1:
    list1.remove(52)
if 8452 in list1:
    list1.remove(8452)
print(list1)
# [1, 400, 5, 6, 228, 112, 1128, 1000, 1002, 200, 4851]
# 从指定的位置删除元素
list1.pop(0)
list1.pop(len(list1) - 1)
print(list1)
# [400, 5, 6, 228, 112, 1128, 1000, 1002, 200]
# 清空列表元素
list1.clear()
print(list1)
#[]